Repository: xacnio/win-app
Catalog: src/Client/Localization/ProtonVPN.Client.Localization/Strings/*/Resources.resw
Source language: en_us
Languages: ar_sa, ca_es, da_dk, hu_hu, th_th, vi_vn, zh_cn, zh_tw

# Country_val_AD
source: Andorra
ar_sa: أندورا
th_th: อันดอร์รา
zh_cn: 安道尔
zh_tw: 安道爾

# Country_val_AE
source: United Arab Emirates
ar_sa: الإمارات العربية المتحدة
ca_es: Emirats Àrabs Units
da_dk: Forenede Arabiske Emirater
hu_hu: Egyesült Arab Emírségek
th_th: สหรัฐอาหรับเอมิเรตส์
vi_vn: Ả Rập Thống Nhất
zh_cn: 阿联酋
zh_tw: 阿拉伯聯合大公國

# Country_val_AF
source: Afghanistan
ar_sa: أفغانستان
ca_es: Afganistan
hu_hu: Afganisztán
th_th: อัฟกานิสถาน
zh_cn: 阿富汗
zh_tw: 阿富汗

# Country_val_AG
source: Antigua and Barbuda
ar_sa: أنتيغا و بربودا
ca_es: Antigua i Barbuda
da_dk: Antigua og Barbudas
hu_hu: Antigua és Barbuda
th_th: แอนติกาและบาร์บูดา
vi_vn: Antigua và Barbuda
zh_cn: 安提瓜和巴布达
zh_tw: 安地卡及巴布達

# Country_val_AI
source: Anguilla
ar_sa: أنغويلا
ca_es: Anguila
th_th: แองกวิลลา
zh_cn: 安圭拉
zh_tw: 安圭拉

# Country_val_AL
source: Albania
ar_sa: ألبانيا
ca_es: Albània
da_dk: Albanien
hu_hu: Albánia
th_th: อัลบาเนีย
zh_cn: 阿尔巴尼亚
zh_tw: 阿爾巴尼亞

# Country_val_AM
source: Armenia
ar_sa: أرمينيا
ca_es: Armènia
da_dk: Armenien
hu_hu: Örményország
th_th: อาร์เมเนีย
zh_cn: 亚美尼亚
zh_tw: 亞美尼亞

# Country_val_AO
source: Angola
ar_sa: أنغولا
th_th: แองโกลา
zh_cn: 安哥拉
zh_tw: 安哥拉

# Country_val_AQ
source: Antarctica
ar_sa: القارة القطبية الجنوبية
ca_es: Antàrtida
da_dk: Antarktis
hu_hu: Antarktisz
th_th: แอนตาร์กติกา
vi_vn: Châu Nam Cực
zh_cn: 南极洲
zh_tw: 南極洲

# Country_val_AR
source: Argentina
ar_sa: الأرجنتين
hu_hu: Argentína
th_th: อาร์เจนตินา
zh_cn: 阿根廷
zh_tw: 阿根廷

# Country_val_AS
source: American Samoa
ar_sa: ساموا الأمريكية
ca_es: Samoa Americana
da_dk: Amerikansk Samoa
hu_hu: Amerikai Szamoa
th_th: อเมริกันซามัว
vi_vn: Samoa thuộc Mỹ
zh_cn: 美属萨摩亚
zh_tw: 美屬薩摩亞

# Country_val_AT
source: Austria
ar_sa: النمسا
ca_es: Àustria
da_dk: Østrig
hu_hu: Ausztria
th_th: ออสเตรีย
vi_vn: Áo
zh_cn: 奥地利
zh_tw: 奧地利

# Country_val_AU
source: Australia
ar_sa: أستراليا
ca_es: Austràlia
da_dk: Australien
hu_hu: Ausztrália
th_th: ออสเตรเลีย
vi_vn: Úc
zh_cn: 澳大利亚
zh_tw: 澳洲

# Country_val_AW
source: Aruba
ar_sa: أروبا
th_th: อารูบา
zh_cn: 阿鲁巴
zh_tw: 阿魯巴

# Country_val_AX
source: Aland Islands
ar_sa: جزر آلند
ca_es: Illes Aland
da_dk: Ålandsøerne
hu_hu: Aland-szigetek
th_th: หมู่เกาะโอลันด์
vi_vn: Quần đảo Aland
zh_cn: 奥兰群岛
zh_tw: 奧蘭群島

# Country_val_AZ
source: Azerbaijan
ar_sa: أذربيجان
ca_es: Azerbaidjan
da_dk: Aserbajdsjan
hu_hu: Azerbajdzsán
th_th: อาเซอร์ไบจาน
zh_cn: 阿塞拜疆
zh_tw: 亞塞拜然

# Country_val_BA
source: Bosnia and Herzegovina
ar_sa: البوسنة والهرسك
ca_es: Bòsnia i Hercegovina
da_dk: Bosnien-Hercegovina
hu_hu: Bosznia-Hercegovina
th_th: บอสเนียและเฮอร์เซโกวีนา
vi_vn: Bosnia và Herzegovina
zh_cn: 波斯尼亚和黑塞哥维那
zh_tw: 波士尼亞與赫塞哥維納

# Country_val_BB
source: Barbados
ar_sa: باربادوس
th_th: บาร์เบโดส
zh_cn: 巴巴多斯
zh_tw: 巴貝多

# Country_val_BD
source: Bangladesh
ar_sa: بنغلاديش
hu_hu: Banglades
th_th: บังคลาเทศ
zh_cn: 孟加拉国
zh_tw: 孟加拉

# Country_val_BE
source: Belgium
ar_sa: بلجيكا
ca_es: Bèlgica
da_dk: Belgien
th_th: เบลเยียม
vi_vn: Bỉ
zh_cn: 比利时
zh_tw: 比利時

# Country_val_BF
source: Burkina Faso
ar_sa: بوركينا فاسو
th_th: บูร์กินาฟาโซ
zh_cn: 布基纳法索
zh_tw: 布吉納法索

# Country_val_BG
source: Bulgaria
ar_sa: بلغاريا
ca_es: Bulgària
da_dk: Bulgarien
hu_hu: Bulgária
th_th: บัลแกเรีย
zh_cn: 保加利亚
zh_tw: 保加利亞

# Country_val_BH
source: Bahrain
ar_sa: البحرين
hu_hu: Bahrein
th_th: บาห์เรน
zh_cn: 巴林
zh_tw: 巴林

# Country_val_BI
source: Burundi
ar_sa: بورندي
th_th: บุรุนดี
vi_vn: Bulgaria
zh_cn: 布隆迪
zh_tw: 蒲隆地

# Country_val_BJ
source: Benin
ar_sa: بنين
ca_es: Benín
th_th: เบนิน
zh_cn: 贝宁
zh_tw: 貝南

# Country_val_BL
source: Saint Barthélemy
ar_sa: سانت بارتيليمي
ca_es: Sant Bartomeu
da_dk: Skt. Barthélemy
th_th: ซางต์ บาร์เตเลมี
zh_cn: 圣巴泰勒米
zh_tw: 聖巴瑟米

# Country_val_BM
source: Bermuda
ar_sa: برمودا
ca_es: Bermudes
th_th: เบอร์มิวดา
zh_cn: 百慕大
zh_tw: 百慕達

# Country_val_BN
source: Brunei Darussalam
ar_sa: بروناي دار السلام
hu_hu: Brunei Darussalam Állam
th_th: บรูไนดารุสซาลาม
zh_cn: 文莱达鲁萨兰
zh_tw: 汶萊

# Country_val_BO
source: Bolivia
ar_sa: بوليفيا
ca_es: Bolívia
hu_hu: Bolívia
th_th: โบลิเวีย
zh_cn: 玻利维亚
zh_tw: 玻利維亞

# Country_val_BQ
source: Bonaire, Sint Eustatius and Saba
ar_sa: بونير، سانت أوستاتيوس وسابا
ca_es: Bonaire, Sint Eustatius i Saba
da_dk: Bonaire, Sint Eustatius og Saba
hu_hu: Bonaire, Sint Eustatius és Saba
th_th: บอแนร์, ซินต์ยุสตาเชียส และซาบา
vi_vn: Bonaire, Sint Eustatius và Saba
zh_cn: 荷兰加勒比区
zh_tw: 博奈爾、聖尤斯特歇斯和薩巴

# Country_val_BR
source: Brazil
ar_sa: البرازيل
ca_es: Brasil
da_dk: Brasilien
hu_hu: Brazília
th_th: บราซิล
zh_cn: 巴西
zh_tw: 巴西

# Country_val_BS
source: Bahamas
ar_sa: الباهاماس
ca_es: Bahames
hu_hu: Bahama-szigetek
th_th: บาฮามาส
zh_cn: 巴哈马
zh_tw: 巴哈馬

# Country_val_BT
source: Bhutan
ar_sa: بوتان
hu_hu: Bhután
th_th: ภูฏาน
zh_cn: 不丹
zh_tw: 不丹

# Country_val_BV
source: Bouvet Island
ar_sa: جزيرة بوفيت
ca_es: Illa Bouvet
da_dk: Bouvetøen
hu_hu: Bouvet-sziget
th_th: เกาะบูเวต
vi_vn: Đảo Bouvet
zh_cn: 布韦岛
zh_tw: 布威島

# Country_val_BW
source: Botswana
ar_sa: بوتسوانا
th_th: บอตสวานา
zh_cn: 博茨瓦纳
zh_tw: 波札那

# Country_val_BY
source: Belarus
ar_sa: روسيا البيضاء
ca_es: Bielorússia
da_dk: Hviderusland
hu_hu: Belarusz
th_th: เบลารุส
zh_cn: 白俄罗斯
zh_tw: 白俄羅斯

# Country_val_BZ
source: Belize
ar_sa: بليز
th_th: เบลีซ
zh_cn: 伯利兹
zh_tw: 貝里斯

# Country_val_CA
source: Canada
ar_sa: كندا
ca_es: Canadà
hu_hu: Kanada
th_th: แคนาดา
zh_cn: 加拿大
zh_tw: 加拿大

# Country_val_CC
source: Cocos (Keeling) Islands
ar_sa: جزر كوكوس (كيلينغ)
ca_es: Illa de Cocos
da_dk: Cocosøerne
hu_hu: Kókusz (Keeling)-szigetek
th_th: หมู่เกาะโคโคส (คีลิง)
vi_vn: Quần đảo Cocos (Keeling)
zh_cn: 科科斯（基林）群岛
zh_tw: 可可斯群島

# Country_val_CD
source: Congo (Democratic Republic of the)
ar_sa: جمهورية الكونغو الديمقراطية
ca_es: República Democràtica del Congo
da_dk: Congo, Demokratiske Republik
hu_hu: Kongói Demokratikus Köztársaság
th_th: คองโก (สาธารณรัฐประชาธิปไตย)
vi_vn: Congo (Cộng hoà dân chủ)
zh_cn: 刚果（金）
zh_tw: 剛果民主共和國

# Country_val_CF
source: Central African Republic
ar_sa: جمهورية إفريقيا الوسطى
ca_es: República Centreafricana
da_dk: Den Centralafrikanske Republik
hu_hu: Közép-afrikai Köztársaság
th_th: สาธารณรัฐแอฟริกากลาง
vi_vn: Cộng hòa Trung Phi
zh_cn: 中非共和国
zh_tw: 中非共和國

# Country_val_CG
source: Congo
ar_sa: الكونغو
hu_hu: Kongó
th_th: คองโก
zh_cn: 刚果（布）
zh_tw: 剛果

# Country_val_CH
source: Switzerland
ar_sa: سويسرا
ca_es: Suïssa
da_dk: Schweiz
hu_hu: Svájc
th_th: สวิตเซอร์แลนด์
vi_vn: Thụy Sĩ
zh_cn: 瑞士
zh_tw: 瑞士

# Country_val_CI
source: Côte d'Ivoire
ar_sa: كوت ديفوار
ca_es: Costa d'Ivori
da_dk: Elfenbenskysten
hu_hu: Elefántcsontpart
th_th: โกตดิวัวร์
zh_cn: 科特迪瓦
zh_tw: 科特迪瓦 (象牙海岸)

# Country_val_CK
source: Cook Islands
ar_sa: جزر كوك
ca_es: Illes Cook
da_dk: Cookøerne
hu_hu: Cook-szigetek
th_th: หมู่เกาะคุก
vi_vn: Quần đảo Cook
zh_cn: 库克群岛
zh_tw: 庫克群島

# Country_val_CL
source: Chile
ar_sa: تشيلي
ca_es: Xile
th_th: ชิลี
zh_cn: 智利
zh_tw: 智利

# Country_val_CM
source: Cameroon
ar_sa: الكاميرون
ca_es: Camerun
hu_hu: Kamerun
th_th: แคเมอรูน
zh_cn: 喀麦隆
zh_tw: 喀麥隆

# Country_val_CN
source: China
ar_sa: الصين
ca_es: Xina
da_dk: Kina
hu_hu: Kína
th_th: จีน
vi_vn: Trung Quốc
zh_cn: 中国
zh_tw: 中國

# Country_val_CO
source: Colombia
ar_sa: كولومبيا
ca_es: Colòmbia
hu_hu: Kolumbia
th_th: โคลอมเบีย
zh_cn: 哥伦比亚
zh_tw: 哥倫比亞

# Country_val_CR
source: Costa Rica
ar_sa: كوستا ريكا
th_th: คอสตาริกา
zh_cn: 哥斯达黎加
zh_tw: 哥斯大黎加

# Country_val_CU
source: Cuba
ar_sa: كوبا
hu_hu: Kuba
th_th: คิวบา
zh_cn: 古巴
zh_tw: 古巴

# Country_val_CV
source: Cape Verde
ar_sa: الرأس الأخضر
ca_es: Cap Verd
da_dk: Kap Verde
hu_hu: Zöld-foki-szigetek
th_th: เคปเวิร์ด
zh_cn: 佛得角
zh_tw: 維德角

# Country_val_CW
source: Curaçao
ar_sa: كوراساو
hu_hu: Curacao
th_th: คูราเซา
zh_cn: 库拉索
zh_tw: 庫拉索

# Country_val_CX
source: Christmas Island
ar_sa: جزيرة كريستماس
ca_es: Illa Christmas
da_dk: Juleøen
hu_hu: Karácsony-sziget
th_th: เกาะคริสต์มาส
vi_vn: Đảo Christmas
zh_cn: 圣诞岛
zh_tw: 聖誕島

# Country_val_CY
source: Cyprus
ar_sa: قبرص
ca_es: Xipre
da_dk: Cypern
hu_hu: Ciprus
th_th: ไซปรัส
zh_cn: 塞浦路斯
zh_tw: 賽普勒斯

# Country_val_CZ
source: Czechia
ar_sa: التشيك
ca_es: Txèquia
da_dk: Tjekkiet
hu_hu: Csehország
th_th: เช็กเกีย
vi_vn: Séc
zh_cn: 捷克
zh_tw: 捷克

# Country_val_DE
source: Germany
ar_sa: ألمانيا
ca_es: Alemanya
da_dk: Tyskland
hu_hu: Németország
th_th: เยอรมนี
vi_vn: Đức
zh_cn: 德国
zh_tw: 德國

# Country_val_DJ
source: Djibouti
ar_sa: جيبوتي
hu_hu: Dzsibuti
th_th: จิบูตี
zh_cn: 吉布提
zh_tw: 吉布地

# Country_val_DK
source: Denmark
ar_sa: الدانمارك
ca_es: Dinamarca
da_dk: Danmark
hu_hu: Dánia
th_th: เดนมาร์ก
vi_vn: Đan Mạch
zh_cn: 丹麦
zh_tw: 丹麥

# Country_val_DM
source: Dominica
ar_sa: الدومينيك
hu_hu: Dominikai Közösség
th_th: โดมินิกา
zh_cn: 多米尼克
zh_tw: 多米尼克

# Country_val_DO
source: Dominican Republic
ar_sa: جمهورية الدومينكان
ca_es: República Dominicana
da_dk: Dominikanske Republik
hu_hu: Dominikai Köztársaság
th_th: สาธารณรัฐโดมินิกัน
vi_vn: Cộng hòa Dominica
zh_cn: 多米尼加共和国
zh_tw: 多明尼加

# Country_val_DZ
source: Algeria
ar_sa: الجزائر
ca_es: Algèria
da_dk: Algeriet
hu_hu: Algéria
th_th: แอลจีเรีย
zh_cn: 阿尔及利亚
zh_tw: 阿爾及利亞

# Country_val_EC
source: Ecuador
ar_sa: الإكوادور
ca_es: Equador
th_th: เอกวาดอร์
zh_cn: 厄瓜多尔
zh_tw: 厄瓜多

# Country_val_EE
source: Estonia
ar_sa: إستونيا
ca_es: Estònia
da_dk: Estland
hu_hu: Észtország
th_th: เอสโตเนีย
zh_cn: 爱沙尼亚
zh_tw: 愛沙尼亞

# Country_val_EG
source: Egypt
ar_sa: مصر
ca_es: Egipte
da_dk: Egypten
hu_hu: Egyiptom
th_th: อียิปต์
vi_vn: Ai Cập
zh_cn: 埃及
zh_tw: 埃及

# Country_val_EH
source: Western Sahara
ar_sa: الصحراء الغربية
ca_es: Sàhara Occidental
da_dk: Vestsahara
hu_hu: Nyugat-Szahara
th_th: เวสเทิร์นสะฮารา
vi_vn: Tây Sahara
zh_cn: 西撒哈拉
zh_tw: 西撒哈拉

# Country_val_ER
source: Eritrea
ar_sa: إريتريا
th_th: เอริเทรีย
zh_cn: 厄立特里亚
zh_tw: 厄利垂亞

# Country_val_ES
source: Spain
ar_sa: إسبانيا
ca_es: Espanya
da_dk: Spanien
hu_hu: Spanyolország
th_th: สเปน
vi_vn: Tây Ban Nha
zh_cn: 西班牙
zh_tw: 西班牙

# Country_val_ET
source: Ethiopia
ar_sa: إثيوبيا
ca_es: Etiòpia
da_dk: Etiopien
hu_hu: Etiópia
th_th: เอธิโอเปีย
zh_cn: 埃塞俄比亚
zh_tw: 衣索比亞

# Country_val_FI
source: Finland
ar_sa: فنلندا
ca_es: Finlàndia
hu_hu: Finnország
th_th: ฟินแลนด์
vi_vn: Phần Lan
zh_cn: 芬兰
zh_tw: 芬蘭

# Country_val_FJ
source: Fiji
ar_sa: فيجي
hu_hu: Fidzsi-szigetek
th_th: ฟิจิ
zh_cn: 斐济
zh_tw: 斐濟

# Country_val_FK
source: Falkland Islands (Malvinas)
ar_sa: جزر فوكلاند (مالفيناس)
ca_es: Illes Falkland (Malvines)
da_dk: Falklandsøerne (Malvinerne)
hu_hu: Falkland-szigetek (Malvinas)
th_th: หมู่เกาะฟอล์กแลนด์ (มาลวินัส)
vi_vn: Quần đảo Falkland (Malvinas)
zh_cn: 福克兰群岛（马尔维纳斯）
zh_tw: 福克蘭群島 (馬維納斯群島)

# Country_val_FM
source: Micronesia
ar_sa: ميكرونيزيا
ca_es: Micronèsia
da_dk: Mikronesien
hu_hu: Mikronézia
th_th: ไมโครนีเซีย
zh_cn: 密克罗尼西亚
zh_tw: 密克羅尼西亞

# Country_val_FO
source: Faroe Islands
ar_sa: جزر فاراو
ca_es: Illes Fèroe
da_dk: Færøerne
hu_hu: Feröer-szigetek
th_th: หมู่เกาะแฟโร
vi_vn: Quần đảo Faroe
zh_cn: 法罗群岛
zh_tw: 法羅群島

# Country_val_FR
source: France
ar_sa: فرنسا
ca_es: França
da_dk: Frankrig
hu_hu: Franciaország
th_th: ฝรั่งเศส
vi_vn: Pháp
zh_cn: 法国
zh_tw: 法國

# Country_val_GA
source: Gabon
ar_sa: الغابون
th_th: กาบอง
zh_cn: 加蓬
zh_tw: 加彭

# Country_val_GB
source: United Kingdom
ar_sa: المملكة المتحدة
ca_es: Regne Unit
da_dk: Storbritannien
hu_hu: Egyesült Királyság
th_th: สหราชอาณาจักร
vi_vn: Vương quốc Anh
zh_cn: 英国
zh_tw: 英國

# Country_val_GD
source: Grenada
ar_sa: غرينادا
ca_es: Granada
th_th: เกรเนดา
zh_cn: 格林纳达
zh_tw: 格瑞那達

# Country_val_GE
source: Georgia
ar_sa: جورجيا
ca_es: Geòrgia
hu_hu: Grúzia
th_th: จอร์เจีย
zh_cn: 格鲁吉亚
zh_tw: 喬治亞

# Country_val_GF
source: French Guiana
ar_sa: غوايانا الفرنسية
ca_es: Guaiana Francesa
da_dk: Fransk Guyana
hu_hu: Francia Guyana
th_th: เฟรนช์เกียนา
vi_vn: Guyane thuộc Pháp
zh_cn: 法属圭亚那
zh_tw: 法屬圭亞那

# Country_val_GG
source: Guernsey
ar_sa: جزيرة جيرنزي
th_th: เกิร์นซีย์
zh_cn: 根西
zh_tw: 根息

# Country_val_GH
source: Ghana
ar_sa: غانا
hu_hu: Ghána
th_th: กานา
zh_cn: 加纳
zh_tw: 迦納

# Country_val_GI
source: Gibraltar
ar_sa: جبل طارق
hu_hu: Gibraltár
th_th: ยิบรอลตาร์
zh_cn: 直布罗陀
zh_tw: 直布羅陀

# Country_val_GL
source: Greenland
ar_sa: غرينلاند
ca_es: Groenlàndia
da_dk: Grønland
hu_hu: Grönland
th_th: กรีนแลนด์
zh_cn: 格陵兰
zh_tw: 格陵蘭

# Country_val_GM
source: Gambia
ar_sa: غامبيا
ca_es: Gàmbia
th_th: แกมเบีย
zh_cn: 冈比亚
zh_tw: 甘比亞

# Country_val_GN
source: Guinea
ar_sa: غينيا
th_th: กินี
zh_cn: 几内亚
zh_tw: 幾內亞

# Country_val_GP
source: Guadeloupe
ar_sa: غوادلوبي
ca_es: Guadalupe
th_th: กวาดอลูป
zh_cn: 瓜德罗普
zh_tw: 瓜地洛普

# Country_val_GQ
source: Equatorial Guinea
ar_sa: غينيا الإستوائية
ca_es: Guinea Equatorial
da_dk: Ækvatorialguinea
hu_hu: Egyenlítői-Guinea
th_th: อิเควทอเรียลกินี
vi_vn: Guinea Xích Đạo
zh_cn: 赤道几内亚
zh_tw: 赤道幾內亞

# Country_val_GR
source: Greece
ar_sa: اليونان
ca_es: Grècia
da_dk: Grækenland
hu_hu: Görögország
th_th: กรีซ
vi_vn: Hy Lạp
zh_cn: 希腊
zh_tw: 希臘

# Country_val_GS
source: South Georgia and the South Sandwich Islands
ar_sa: جورجيا الجنوبية وجزر ساندويتش الجنوبية
ca_es: Illes Geòrgia del Sud i Sandwich del Sud
da_dk: Sydgeorgien og de sydlige Sandwichøer
hu_hu: Déli-Georgia és Déli-Sandwich-szigetek
th_th: เกาะเซาท์จอร์เจียและหมู่เกาะเซาท์แซนด์วิช
vi_vn: Nam Georgia và Quần đảo Nam Sandwich
zh_cn: 南乔治亚岛和南桑威奇群岛
zh_tw: 南喬治亞與南三明治群島

# Country_val_GT
source: Guatemala
ar_sa: غواتيمالا
th_th: กัวเตมาลา
zh_cn: 危地马拉
zh_tw: 瓜地馬拉

# Country_val_GU
source: Guam
ar_sa: غوام
th_th: กวม
zh_cn: 关岛
zh_tw: 關島

# Country_val_GW
source: Guinea-Bissau
ar_sa: غينيا بيساو
hu_hu: Bissau-Guinea
th_th: กินี-บิสเซา
zh_cn: 几内亚比绍
zh_tw: 幾內亞比索

# Country_val_GY
source: Guyana
ar_sa: غويانا
th_th: กายอานา
zh_cn: 圭亚那
zh_tw: 蓋亞那

# Country_val_HK
source: Hong Kong
ar_sa: هونغ كونغ
th_th: ฮ่องกง
vi_vn: Hồng Kông
zh_cn: 中国香港
zh_tw: 香港

# Country_val_HM
source: Heard Island and McDonald Islands
ar_sa: جزيرة هيرد وجزر ماكدونالد
ca_es: Illa Heard i Illes McDonald
da_dk: Heard Island og McDonald Islands
hu_hu: Heard-sziget és McDonald-szigetek
th_th: เกาะเฮิร์ดและหมู่เกาะแมกดอนัลด์
vi_vn: Quần đảo Heard và McDonald
zh_cn: 赫德岛和麦克唐纳群岛
zh_tw: 赫德島及麥唐納群島

# Country_val_HN
source: Honduras
ar_sa: هندوراس
ca_es: Hondures
th_th: ฮอนดูรัส
zh_cn: 洪都拉斯
zh_tw: 宏都拉斯

# Country_val_HR
source: Croatia
ar_sa: كرواتيا
ca_es: Croàcia
da_dk: Kroatien
hu_hu: Horvátország
th_th: โครเอเชีย
zh_cn: 克罗地亚
zh_tw: 克羅埃西亞

# Country_val_HT
source: Haiti
ar_sa: هايتي
ca_es: Haití
th_th: เฮติ
zh_cn: 海地
zh_tw: 海地

# Country_val_HU
source: Hungary
ar_sa: المجر
ca_es: Hongria
da_dk: Ungarn
hu_hu: Magyarország
th_th: ฮังการี
zh_cn: 匈牙利
zh_tw: 匈牙利

# Country_val_ID
source: Indonesia
ar_sa: أندونيسيا
ca_es: Indonèsia
da_dk: Indonesien
hu_hu: Indonézia
th_th: อินโดนีเซีย
zh_cn: 印度尼西亚
zh_tw: 印尼

# Country_val_IE
source: Ireland
ar_sa: أيرلندا
ca_es: Irlanda
da_dk: Irland
hu_hu: Írország
th_th: ไอร์แลนด์
zh_cn: 爱尔兰
zh_tw: 愛爾蘭

# Country_val_IL
source: Israel
ar_sa: إسرائيل
hu_hu: Izrael
th_th: อิสราเอล
zh_cn: 以色列
zh_tw: 以色列

# Country_val_IM
source: Isle of Man
ar_sa: جزيرة إيل أوف مان
ca_es: Illa de Man
hu_hu: Man-sziget
th_th: เกาะแมน
vi_vn: Đảo Man
zh_cn: 马恩岛
zh_tw: 曼島

# Country_val_IN
source: India
ar_sa: الهند
ca_es: Índia
da_dk: Indien
th_th: อินเดีย
vi_vn: Ấn Độ
zh_cn: 印度
zh_tw: 印度

# Country_val_IO
source: British Indian Ocean Territory
ar_sa: إقليم المحيط الهندي البريطاني
ca_es: Territori Britànic de l'Oceà Índic
da_dk: Britiske territorium i Det Indiske Ocean
hu_hu: Brit Indiai-óceáni Terület
th_th: บริติชอินเดียนโอเชียนเทร์ริทอรี
vi_vn: Lãnh thổ Ấn Độ Dương thuộc Anh
zh_cn: 英属印度洋领地
zh_tw: 英屬印度洋領地

# Country_val_IQ
source: Iraq
ar_sa: العراق
da_dk: Irak
hu_hu: Irak
th_th: อิรัก
zh_cn: 伊拉克
zh_tw: 伊拉克

# Country_val_IR
source: Iran
ar_sa: إيران
hu_hu: Irán
th_th: อิหร่าน
zh_cn: 伊朗
zh_tw: 伊朗

# Country_val_IS
source: Iceland
ar_sa: آيسلندا
ca_es: Islàndia
da_dk: Island
hu_hu: Izland
th_th: ไอซ์แลนด์
zh_cn: 冰岛
zh_tw: 冰島

# Country_val_IT
source: Italy
ar_sa: إيطاليا
ca_es: Itàlia
da_dk: Italien
hu_hu: Olaszország
th_th: อิตาลี
vi_vn: Ý
zh_cn: 意大利
zh_tw: 義大利

# Country_val_JE
source: Jersey
ar_sa: جيرسي
th_th: เจอร์ซีย์
zh_cn: 泽西
zh_tw: 澤西島

# Country_val_JM
source: Jamaica
ar_sa: جامايكا
th_th: จาเมกา
zh_cn: 牙买加
zh_tw: 牙買加

# Country_val_JO
source: Jordan
ar_sa: الأردن
ca_es: Jordània
hu_hu: Jordánia
th_th: จอร์แดน
zh_cn: 约旦
zh_tw: 約旦

# Country_val_JP
source: Japan
ar_sa: اليابان
ca_es: Japó
hu_hu: Japán
th_th: ญี่ปุ่น
vi_vn: Nhật Bản
zh_cn: 日本
zh_tw: 日本

# Country_val_KE
source: Kenya
ar_sa: كينيا
ca_es: Kènia
th_th: เคนยา
zh_cn: 肯尼亚
zh_tw: 肯亞

# Country_val_KG
source: Kyrgyzstan
ar_sa: قيرغيزستان
ca_es: Kirguizstan
da_dk: Kirgisistan
hu_hu: Kirgizisztán
th_th: คีร์กีซสถาน
zh_cn: 吉尔吉斯斯坦
zh_tw: 吉爾吉斯

# Country_val_KH
source: Cambodia
ar_sa: كمبوديا
ca_es: Cambodja
da_dk: Cambodja
hu_hu: Kambodzsa
th_th: กัมพูชา
vi_vn: Campuchia
zh_cn: 柬埔寨
zh_tw: 柬埔寨

# Country_val_KI
source: Kiribati
ar_sa: كيريباتي
th_th: คิริบาส
zh_cn: 基里巴斯
zh_tw: 吉里巴斯

# Country_val_KM
source: Comoros
ar_sa: جزر القمر
ca_es: Comores
da_dk: Comorerne
hu_hu: Comore-szigetek
th_th: คอโมโรส
zh_cn: 科摩罗
zh_tw: 葛摩

# Country_val_KN
source: Saint Kitts and Nevis
ar_sa: سانت كيتس ونيفيس
ca_es: Saint Kitts i Nevis
da_dk: Saint Kitts og Nevis
hu_hu: Saint Kitts és Nevis
th_th: เซนต์คิตส์และเนวิส
vi_vn: Saint Kitts và Nevis
zh_cn: 圣基茨和尼维斯
zh_tw: 聖克里斯多福及尼維斯

# Country_val_KP
source: North Korea
ar_sa: كوريا الشمالية
ca_es: Corea del Nord
da_dk: Nordkorea
hu_hu: Észak-Korea
th_th: เกาหลีเหนือ
vi_vn: Triều Tiên
zh_cn: 朝鲜
zh_tw: 北韓

# Country_val_KR
source: South Korea
ar_sa: كوريا الجنوبية
ca_es: Corea del Sud
da_dk: Sydkorea
hu_hu: Dél-Korea
th_th: เกาหลีใต้
vi_vn: Hàn Quốc
zh_cn: 韩国
zh_tw: 南韓

# Country_val_KW
source: Kuwait
ar_sa: الكويت
hu_hu: Kuvait
th_th: คูเวต
zh_cn: 科威特
zh_tw: 科威特

# Country_val_KY
source: Cayman Islands
ar_sa: جزر الكايمان
ca_es: Illes Caimà
da_dk: Caymanøerne
hu_hu: Kajmán-szigetek
th_th: หมู่เกาะเคย์แมน
vi_vn: Quần đảo Cayman
zh_cn: 开曼群岛
zh_tw: 開曼群島

# Country_val_KZ
source: Kazakhstan
ar_sa: كازاخستان
da_dk: Kasakhstan
hu_hu: Kazahsztán
th_th: คาซัคสถาน
zh_cn: 哈萨克斯坦
zh_tw: 哈薩克

# Country_val_LA
source: Laos
ar_sa: لاوس
hu_hu: Laosz
th_th: ลาว
vi_vn: Lào
zh_cn: 老挝
zh_tw: 寮國

# Country_val_LB
source: Lebanon
ar_sa: لبنان
ca_es: Líban
da_dk: Libanon
hu_hu: Libanon
th_th: เลบานอน
zh_cn: 黎巴嫩
zh_tw: 黎巴嫩

# Country_val_LC
source: Saint Lucia
ar_sa: سانتا لوسيا
th_th: เซนต์ลูเซีย
zh_cn: 圣卢西亚
zh_tw: 聖露西亞

# Country_val_LI
source: Liechtenstein
ar_sa: ليشتنشتاين
th_th: ลิกเตนสไตน์
zh_cn: 列支敦士登
zh_tw: 列支敦斯登

# Country_val_LK
source: Sri Lanka
ar_sa: سريلانكا
hu_hu: Srí Lanka
th_th: ศรีลังกา
zh_cn: 斯里兰卡
zh_tw: 斯里蘭卡

# Country_val_LR
source: Liberia
ar_sa: ليبيريا
ca_es: Libèria
hu_hu: Libéria
th_th: ไลบีเรีย
zh_cn: 利比里亚
zh_tw: 賴比瑞亞

# Country_val_LS
source: Lesotho
ar_sa: ليسوتو
th_th: เลโซโท
zh_cn: 莱索托
zh_tw: 賴索托

# Country_val_LT
source: Lithuania
ar_sa: لتوانيا
ca_es: Lituània
da_dk: Litauen
hu_hu: Litvánia
th_th: ลิทัวเนีย
vi_vn: Litva
zh_cn: 立陶宛
zh_tw: 立陶宛

# Country_val_LU
source: Luxembourg
ar_sa: لوكسمبورج
ca_es: Luxemburg
hu_hu: Luxemburg
th_th: ลักเซมเบิร์ก
zh_cn: 卢森堡
zh_tw: 盧森堡

# Country_val_LV
source: Latvia
ar_sa: لاتفيا
ca_es: Letònia
da_dk: Letland
hu_hu: Lettország
th_th: ลัตเวีย
zh_cn: 拉脱维亚
zh_tw: 拉脫維亞

# Country_val_LY
source: Libya
ar_sa: ليبيا
ca_es: Líbia
da_dk: Libyen
hu_hu: Líbia
th_th: ลิเบีย
zh_cn: 利比亚
zh_tw: 利比亞

# Country_val_MA
source: Morocco
ar_sa: المغرب
ca_es: Marroc
da_dk: Marokko
hu_hu: Marokkó
th_th: โมร็อกโก
zh_cn: 摩洛哥
zh_tw: 摩洛哥

# Country_val_MC
source: Monaco
ar_sa: موناكو
ca_es: Mònaco
th_th: โมนาโก
vi_vn: Morocco
zh_cn: 摩纳哥
zh_tw: 摩納哥

# Country_val_MD
source: Moldova
ar_sa: مولدوفا
ca_es: Moldàvia
th_th: มอลโดวา
zh_cn: 摩尔多瓦
zh_tw: 摩爾多瓦

# Country_val_ME
source: Montenegro
ar_sa: مونتنغرو
hu_hu: Montenegró
th_th: มอนเตเนโกร
zh_cn: 黑山
zh_tw: 蒙特內哥羅

# Country_val_MF
source: Saint Martin (French part)
ar_sa: سانت مارتن (الجزء الفرنسي)
ca_es: Saint Martin (part francesa)
da_dk: Saint Martin (franske del)
hu_hu: Saint Martin (francia rész)
th_th: เซนต์มาร์ติน (ส่วนของฝรั่งเศส)
vi_vn: Saint Martin (phần của Pháp)
zh_cn: 法属圣马丁
zh_tw: 法屬聖馬丁

# Country_val_MG
source: Madagascar
ar_sa: مدغشقر
da_dk: Madagaskar
hu_hu: Madagaszkár
th_th: มาดากัสการ์
zh_cn: 马达加斯加
zh_tw: 馬達加斯加

# Country_val_MH
source: Marshall Islands
ar_sa: جزر مارشال
ca_es: Illes Marshall
da_dk: Marshalløerne
hu_hu: Marshall-szigetek
th_th: หมู่เกาะมาร์แชลล์
vi_vn: Quần đảo Marshall
zh_cn: 马绍尔群岛
zh_tw: 馬紹爾群島

# Country_val_MK
source: Macedonia
ar_sa: مقدونيا
ca_es: Macedònia
da_dk: Makedonien
hu_hu: Macedónia
th_th: มาซิโดเนีย
zh_cn: 北马其顿共和国
zh_tw: 馬其頓

# Country_val_ML
source: Mali
ar_sa: مالي
th_th: มาลี
zh_cn: 马里
zh_tw: 馬利

# Country_val_MM
source: Myanmar
ar_sa: ميانمار
hu_hu: Mianmar
th_th: เมียนมา
zh_cn: 缅甸
zh_tw: 緬甸

# Country_val_MN
source: Mongolia
ar_sa: منغوليا
ca_es: Mongòlia
da_dk: Mongoliet
hu_hu: Mongólia
th_th: มองโกเลีย
vi_vn: Mông Cổ
zh_cn: 蒙古
zh_tw: 蒙古

# Country_val_MO
source: Macao
ar_sa: ماكاو
ca_es: Macau
da_dk: Macau
hu_hu: Makaó
th_th: มาเก๊า
zh_cn: 中国澳门
zh_tw: 澳門

# Country_val_MP
source: Northern Mariana Islands
ar_sa: جزر ماريانا الشمالية
ca_es: Illes Mariannes del Nord
da_dk: Nordmarianerne
hu_hu: Északi-Mariana-szigetek
th_th: หมู่เกาะนอร์เทิร์นมาเรียนา
vi_vn: Quần đảo Bắc Mariana
zh_cn: 北马里亚纳群岛
zh_tw: 北馬利安納群島

# Country_val_MQ
source: Martinique
ar_sa: جزر المارتينيك
ca_es: Martinica
th_th: มาร์ตินีก
zh_cn: 马提尼克
zh_tw: 馬丁尼克

# Country_val_MR
source: Mauritania
ar_sa: موريتانيا
ca_es: Mauritània
da_dk: Mauretanien
hu_hu: Mauritánia
th_th: มอริเตเนีย
zh_cn: 毛里塔尼亚
zh_tw: 茅利塔尼亞

# Country_val_MS
source: Montserrat
ar_sa: مونتسيرات
th_th: มอนต์เซอร์รัต
zh_cn: 蒙特塞拉特
zh_tw: 蒙哲臘

# Country_val_MT
source: Malta
ar_sa: مالطا
hu_hu: Málta
th_th: มอลตา
zh_cn: 马耳他
zh_tw: 馬爾他

# Country_val_MU
source: Mauritius
ar_sa: موريشيوس
ca_es: Illes Maurici
th_th: มอริเชียส
zh_cn: 毛里求斯
zh_tw: 模里西斯

# Country_val_MV
source: Maldives
ar_sa: جزر المالديف
ca_es: Illes Maldives
da_dk: Maldiverne
hu_hu: Maldív-szigetek
th_th: มัลดีฟส์
zh_cn: 马尔代夫
zh_tw: 馬爾地夫

# Country_val_MW
source: Malawi
ar_sa: مالاوي
th_th: มาลาวี
zh_cn: 马拉维
zh_tw: 馬拉威

# Country_val_MX
source: Mexico
ar_sa: المكسيك
ca_es: Mèxic
hu_hu: Mexikó
th_th: เม็กซิโก
zh_cn: 墨西哥
zh_tw: 墨西哥

# Country_val_MY
source: Malaysia
ar_sa: ماليزيا
ca_es: Malàisia
hu_hu: Malajzia
th_th: มาเลเซีย
zh_cn: 马来西亚
zh_tw: 馬來西亞

# Country_val_MZ
source: Mozambique
ar_sa: الموزمبيق
ca_es: Moçambic
hu_hu: Mozambik
th_th: โมซัมบิก
zh_cn: 莫桑比克
zh_tw: 莫三比克

# Country_val_NA
source: Namibia
ar_sa: ناميبيا
ca_es: Namíbia
hu_hu: Namíbia
th_th: นามิเบีย
zh_cn: 纳米比亚
zh_tw: 納米比亞

# Country_val_NC
source: New Caledonia
ar_sa: كاليدونيا الجديدة
ca_es: Nova Caledònia
da_dk: Ny Kaledonien
hu_hu: Új-Kaledónia
th_th: นิวแคลิโดเนีย
zh_cn: 新喀里多尼亚
zh_tw: 新喀里多尼亞

# Country_val_NE
source: Niger
ar_sa: النيجر
ca_es: Níger
th_th: ไนเจอร์
zh_cn: 尼日尔
zh_tw: 尼日

# Country_val_NF
source: Norfolk Island
ar_sa: جزيرة نورفولك
ca_es: Illa Norfolk
da_dk: Norfolkøen
hu_hu: Norfolk-sziget
th_th: เกาะนอร์ฟอล์ก
vi_vn: Đảo Norfolk
zh_cn: 诺福克岛
zh_tw: 諾福克島

# Country_val_NG
source: Nigeria
ar_sa: نيجيريا
ca_es: Nigèria
hu_hu: Nigéria
th_th: ไนจีเรีย
zh_cn: 尼日利亚
zh_tw: 奈及利亞

# Country_val_NI
source: Nicaragua
ar_sa: نيكاراغوا
th_th: นิการากัว
zh_cn: 尼加拉瓜
zh_tw: 尼加拉瓜

# Country_val_NL
source: Netherlands
ar_sa: هولندا
ca_es: Països Baixos
da_dk: Nederlandene
hu_hu: Hollandia
th_th: เนเธอร์แลนด์
vi_vn: Hà Lan
zh_cn: 荷兰
zh_tw: 荷蘭

# Country_val_NO
source: Norway
ar_sa: النرويج
ca_es: Noruega
da_dk: Norge
hu_hu: Norvégia
th_th: นอร์เวย์
vi_vn: Na Uy
zh_cn: 挪威
zh_tw: 挪威

# Country_val_NP
source: Nepal
ar_sa: نيبال
hu_hu: Nepál
th_th: เนปาล
zh_cn: 尼泊尔
zh_tw: 尼泊爾

# Country_val_NR
source: Nauru
ar_sa: ناورو
th_th: นาอูรู
zh_cn: 瑙鲁
zh_tw: 諾魯

# Country_val_NU
source: Niue
ar_sa: نيوي
th_th: นีอูเอ
zh_cn: 纽埃
zh_tw: 紐威島

# Country_val_NZ
source: New Zealand
ar_sa: نيوزيلندا
ca_es: Nova Zelanda
hu_hu: Új-Zéland
th_th: นิวซีแลนด์
zh_cn: 新西兰
zh_tw: 紐西蘭
